uhnp/src/DataProcessors/ГрупповоеИзменениеЭлементовОтчета/ГрупповоеИзменениеЭлементовОтчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ГрупповоеИзменениеЭлементовОтчета</name>
  <attributes>
    <name>ВидОтчета</name>
    <type>
      <types>CatalogRef.ВидыОтчетов</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

uhnp/src/Catalogs/СтрокиОтчетов/СтрокиОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтрокиОтчетов</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.ВидыОтчетов</owners>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения</name>
    <type>
      <types>EnumRef.ТипыЗначенийПоказателейОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОбработки</name>
    <type>
      <types>EnumRef.СпособыОбработкиПоказателейОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКурса</name>
    <type>
      <types>EnumRef.ВидыКурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядковыйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидИтога</name>
    <type>
      <types>EnumRef.ВидыИтоговПоказателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПоказателя</name>
    <type>
      <types>EnumRef.ВидыПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействияПриАктуализации</name>
    <type>
      <types>EnumRef.ДействияПриАктуализацииБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Внутригрупповой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеМасштабируется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаименование1</name>
    <comment>Наименование на дополнительном языке 1</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаименование2</name>
    <comment>Наименование на дополнительном языке 1</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриходРасход</name>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДоходовИРасходов</name>
    <type>
      <types>CatalogRef.СтатьиДоходовИРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Предназначение</name>
    <type>
      <types>EnumRef.ПредназначенияЭлементовСтруктурыОтчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаПоложительногоОтклонения</name>
    <type>
      <types>EnumRef.ВидыОценокОтклонений</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммироватьПодчиненные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетБД</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияРесурсов</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияРесурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаРаскрытия</name>
    <type>
      <types>CatalogRef.ГруппыРаскрытия</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделениеПоПроектам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НормализованныйКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодавлятьИерархиюПоПериодам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлементСправочникаБД</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяУказываетсяВАналитике</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаСтатейДляУстановкиАналитикБДДС</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаСтатейДляУстановкиАналитикБДР</name>
    <type>
      <types>CatalogRef.СтатьиДоходовИРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаСтатьи</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/Catalogs/КолонкиОтчетов/КолонкиОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КолонкиОтчетов</name>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.ВидыОтчетов</owners>
  <attributes>
    <name>ПорядковыйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения</name>
    <type>
      <types>EnumRef.ТипыЗначенийПоказателейОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОбработки</name>
    <type>
      <types>EnumRef.СпособыОбработкиПоказателейОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКурса</name>
    <type>
      <types>EnumRef.ВидыКурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>НеМасштабируется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаименование1</name>
    <comment>Наименование на дополнительном языке 1</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаименование2</name>
    <comment>Наименование на дополнительном языке 1</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидИтогаПоСчету</name>
    <type>
      <types>EnumRef.ВидыБухгалтерскихИтогов</types>
    </type>
  </attributes>
  <attributes>
    <name>Предназначение</name>
    <type>
      <types>EnumRef.ПредназначенияЭлементовСтруктурыОтчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидИтогаСокращеннойОСВ</name>
    <type>
      <types>EnumRef.ДебетКредит</types>
    </type>
  </attributes>
  <attributes>
    <name>НормализованныйКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеФинансовый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/Catalogs/ПоказателиОтчетов/ПоказателиОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПоказателиОтчетов</name>
  <owners>Catalog.ВидыОтчетов</owners>
  <owners>Catalog.ШаблоныТрансформационныхКорректировок</owners>
  <attributes>
    <name>ВидИтога</name>
    <type>
      <types>EnumRef.ВидыИтоговПоказателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКурса</name>
    <type>
      <types>EnumRef.ВидыКурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПоказателя</name>
    <type>
      <types>EnumRef.ВидыПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнутриГрупповой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаРаскрытия</name>
    <type>
      <types>CatalogRef.ГруппыРаскрытия</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействияПриАктуализации</name>
    <type>
      <types>EnumRef.ДействияПриАктуализацииБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Колонка</name>
    <type>
      <types>CatalogRef.КолонкиОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>НеМасштабируется</name>
    <comment>Точность отображения показателя не зависит от точности отображения документа</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеФинансовый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаПоложительногоОтклонения</name>
    <type>
      <types>EnumRef.ВидыОценокОтклонений</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриходРасход</name>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </attributes>
  <attributes>
    <name>СвязанныйПоказатель</name>
    <type>
      <types>CatalogRef.ПоказателиОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОбработки</name>
    <type>
      <types>EnumRef.СпособыОбработкиПоказателейОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДоходовИРасходов</name>
    <type>
      <types>CatalogRef.СтатьиДоходовИРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Строка</name>
    <type>
      <types>CatalogRef.СтрокиОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуффиксКода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения</name>
    <type>
      <types>EnumRef.ТипыЗначенийПоказателейОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧисловойПоказатель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетБД</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидИтогаПоСчету</name>
    <type>
      <types>EnumRef.ВидыБухгалтерскихИтогов</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррСчетБД</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>Предназначение</name>
    <type>
      <types>EnumRef.ПредназначенияЭлементовСтруктурыОтчета</types>
    </type>
  </attributes>
  <attributes>
    <name>РесурсРегистра</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядковыйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проверочный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокУстранения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньКритичности</name>
    <type>
      <types>EnumRef.УровниКритичностиКонтрольныхСоотношений</types>
    </type>
  </attributes>
  <attributes>
    <name>Валютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияРесурсов</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияРесурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДляОтраженияКурсовыхРазниц</name>
    <comment>//Удалить</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделениеПоПроектам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПересчитыватьВалютнуюСумму</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Защищенный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентТР</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НормализованныйКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПоказателя</name>
    <type>
      <types>CatalogRef.ТипыПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаИтогаПоПериоду</name>
    <type>
      <types>EnumRef.ВидыИтоговПоказателяПоПериоду</types>
    </type>
  </attributes>
  <attributes>
    <name>НеСуммируется</name>
    <comment>Не суммируется при консолидации / свертке значений</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролируемыйПоказатель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаименование1</name>
    <comment>Наименование на дополнительном языке 1</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаименование2</name>
    <comment>Наименование на дополнительном языке 2</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_КонтролироватьЛимиты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОстаточныйПоказатель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РассчитываетсяПослеКонвертации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПоказателиДляКурсовВалют</name>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказательКурса</name>
      <type>
        <types>CatalogRef.ПоказателиОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Кратность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/DataProcessors/ГрупповоеИзменениеЭлементовОтчета/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Функция ОпределитьСтруктуруИзменяемыхДанных(ТипЭлемента, МассивОбъектов, ТекущаяТаблицаВыбора) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Если ТипЭлемента = "Строка" Тогда
		
		ТекстЗапроса = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СтрокиОтчетов.Ссылка,
			|	СтрокиОтчетов.ГруппаРаскрытия КАК ГруппаРаскрытия,
			|	СтрокиОтчетов.ВидПоказателя,
			|	СтрокиОтчетов.ДействияПриАктуализации,
			|	СтрокиОтчетов.ВидКурса,
			|	СтрокиОтчетов.ВидИтога,
			|	СтрокиОтчетов.Внутригрупповой,
			|	СтрокиОтчетов.НеМасштабируется,
			|	СтрокиОтчетов.Код,
			|	СтрокиОтчетов.ТипЗначения,
			|	СтрокиОтчетов.Родитель КАК Родитель,
			|	СтрокиОтчетов.Предназначение,
			|	СтрокиОтчетов.ПриходРасход,
			|	СтрокиОтчетов.ОценкаПоложительногоОтклонения,
			|	СтрокиОтчетов.СчетБД,
			|	СтрокиОтчетов.РазделениеПоПроектам КАК РазделениеПоПроектам
			|ПОМЕСТИТЬ ВнутренняяТаблица
			|ИЗ
			|	Справочник.СтрокиОтчетов КАК СтрокиОтчетов
			|ГДЕ
			|	НЕ СтрокиОтчетов.ПометкаУдаления
			|	И СтрокиОтчетов.Ссылка В(&МассивОбъектов)";
		
		ДополнитьТекстЗапроса(ТекстЗапроса, "ГруппаРаскрытия", Истина);
		ДополнитьТекстЗапроса(ТекстЗапроса, "ВидПоказателя", Ложь);
		ДополнитьТекстЗапроса(ТекстЗапроса, "ДействияПриАктуализации", Ложь);
		ДополнитьТекстЗапроса(ТекстЗапроса, "ВидКурса", Ложь);
		ДополнитьТекстЗапроса(ТекстЗапроса, "ВидИтога", Ложь);
		ДополнитьТекстЗапроса(ТекстЗапроса, "Внутригрупповой", Ложь);
		ДополнитьТекстЗапроса(ТекстЗапроса, "НеМасштабируется", Ложь);
		ДополнитьТекстЗапроса(ТекстЗапроса, "ТипЗначения", Ложь);
		ДополнитьТекстЗапроса(ТекстЗапроса, "СчетБД", Ложь);
		ДополнитьТекстЗапроса(ТекстЗапроса, "Родитель", Ложь);
		ДополнитьТекстЗапроса(ТекстЗапроса, "Предназначение", Ложь);
		ДополнитьТекстЗапроса(ТекстЗапроса, "ПриходРасход", Ложь);
		ДополнитьТекстЗапроса(ТекстЗапроса, "ОценкаПоложительногоОтклонения", Ложь);
		ДополнитьТекстЗапроса(ТекстЗапроса, "РазделениеПоПроектам", Ложь);
		
	ИначеЕсли ТипЭлемента = "Колонка" Тогда
		
		ТекстЗапроса = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	КолонкиОтчетов.Ссылка,
			|	КолонкиОтчетов.ТипЗначения,
			|	КолонкиОтчетов.ВидКурса,
			|	КолонкиОтчетов.НеМасштабируется,
			|	КолонкиОтчетов.Код,
			|	КолонкиОтчетов.ВидИтогаПоСчету
			|ПОМЕСТИТЬ ВнутренняяТаблица
			|ИЗ
			|	Справочник.КолонкиОтчетов КАК КолонкиОтчетов
			|ГДЕ
			|	НЕ КолонкиОтчетов.ПометкаУдаления
			|	И КолонкиОтчетов.Ссылка В(&МассивОбъектов)";
		
		ДополнитьТекстЗапроса(ТекстЗапроса, "ТипЗначения", Истина);
		ДополнитьТекстЗапроса(ТекстЗапроса, "ВидКурса", Ложь);
		ДополнитьТекстЗапроса(ТекстЗапроса, "НеМасштабируется", Ложь);
		ДополнитьТекстЗапроса(ТекстЗапроса, "ВидИтогаПоСчету", Ложь);
		
	Иначе

		ТекстЗапроса = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ПоказателиОтчетов.Ссылка КАК Ссылка,
			|	ПоказателиОтчетов.ГруппаРаскрытия КАК ГруппаРаскрытия,
			|	ПоказателиОтчетов.Строка.ГруппаРаскрытия КАК ГруппаРаскрытияСтрока,
			|	ПоказателиОтчетов.ВидПоказателя КАК ВидПоказателя,
			|	ПоказателиОтчетов.Строка.ВидПоказателя КАК ВидПоказателяСтрока,
			|	ПоказателиОтчетов.ДействияПриАктуализации КАК ДействияПриАктуализации,
			|	ПоказателиОтчетов.Строка.ДействияПриАктуализации КАК ДействияПриАктуализацииСтрока,
			|	ПоказателиОтчетов.ОценкаПоложительногоОтклонения КАК ОценкаПоложительногоОтклонения,
			|	ПоказателиОтчетов.Строка.ОценкаПоложительногоОтклонения КАК ОценкаПоложительногоОтклоненияСтрока,
			|	ПоказателиОтчетов.ВидИтога КАК ВидИтога,
			|	ПоказателиОтчетов.ВидКурса КАК ВидКурса,
			|	ПоказателиОтчетов.СвязанныйПоказатель КАК СвязанныйПоказатель,
			|	ПоказателиОтчетов.НеФинансовый КАК НеФинансовый,
			|	ПоказателиОтчетов.Код КАК Код,
			|	ПоказателиОтчетов.НеМасштабируется КАК НеМасштабируется,
			|	ПоказателиОтчетов.ТипЗначения КАК ТипЗначения,
			|	ПоказателиОтчетов.ВнутриГрупповой КАК ВнутриГрупповой,
			|	ПоказателиОтчетов.Предназначение КАК Предназначение,
			|	ПоказателиОтчетов.ПриходРасход КАК ПриходРасход,
			|	ПоказателиОтчетов.Строка.Предназначение КАК ПредназначениеСтрока,
			|	ПоказателиОтчетов.Строка.ПриходРасход КАК ПриходРасходСтрока,
			|	ПоказателиОтчетов.СчетБД КАК СчетБД,
			|	ПоказателиОтчетов.ВидИтогаПоСчету КАК ВидИтогаПоСчету,
			|	ПоказателиОтчетов.Колонка.ВидИтогаПоСчету КАК ВидИтогаПоСчетуКолонка,
			|	ПоказателиОтчетов.Строка.СчетБД КАК СчетБДСтрока,
			|	ПоказателиОтчетов.Валютный КАК Валютный,
			|	ПоказателиОтчетов.ПересчитыватьВалютнуюСумму КАК ПересчитыватьВалютнуюСумму,
			|	ПоказателиОтчетов.РазделениеПоПроектам КАК РазделениеПоПроектам,
			|	ПоказателиОтчетов.НеСуммируется КАК НеСуммируется,
			|	ПоказателиОтчетов.КонтролируемыйПоказатель КАК КонтролируемыйПоказатель,
			|	ПоказателиОтчетов.РассчитываетсяПослеКонвертации КАК РассчитываетсяПослеКонвертации
			|ПОМЕСТИТЬ ВнутренняяТаблица
			|ИЗ
			|	Справочник.ПоказателиОтчетов КАК ПоказателиОтчетов
			|ГДЕ
			|	НЕ ПоказателиОтчетов.ПометкаУдаления
			|	И ПоказателиОтчетов.Ссылка В(&МассивОбъектов)";
		
		ДополнитьТекстЗапроса(ТекстЗапроса, "ГруппаРаскрытия", Истина);
		ДополнитьТекстЗапроса(ТекстЗапроса, "ВидПоказателя", Ложь);
		ДополнитьТекстЗапроса(ТекстЗапроса, "ДействияПриАктуализации", Ложь);
		ДополнитьТекстЗапроса(ТекстЗапроса, "ОценкаПоложительногоОтклонения", Ложь);
		ДополнитьТекстЗапроса(ТекстЗапроса, "ВидИтога", Ложь);
		ДополнитьТекстЗапроса(ТекстЗапроса, "ВидКурса", Ложь);
		ДополнитьТекстЗапроса(ТекстЗапроса, "СвязанныйПоказатель", Ложь);
		ДополнитьТекстЗапроса(ТекстЗапроса, "Нефинансовый", Ложь);
		ДополнитьТекстЗапроса(ТекстЗапроса, "НеМасштабируется", Ложь);
		ДополнитьТекстЗапроса(ТекстЗапроса, "ТипЗначения", Ложь);
		ДополнитьТекстЗапроса(ТекстЗапроса, "Внутригрупповой", Ложь);
		ДополнитьТекстЗапроса(ТекстЗапроса, "Предназначение", Ложь);
		ДополнитьТекстЗапроса(ТекстЗапроса, "ПриходРасход", Ложь);
		ДополнитьТекстЗапроса(ТекстЗапроса, "СчетБД", Ложь);
		ДополнитьТекстЗапроса(ТекстЗапроса, "ВидИтогаПоСчету", Ложь);
		ДополнитьТекстЗапроса(ТекстЗапроса, "Валютный", Ложь);
		ДополнитьТекстЗапроса(ТекстЗапроса, "ПересчитыватьВалютнуюСумму", Ложь);
		ДополнитьТекстЗапроса(ТекстЗапроса, "РазделениеПоПроектам", Ложь);
		ДополнитьТекстЗапроса(ТекстЗапроса, "НеСуммируется", Ложь);
		ДополнитьТекстЗапроса(ТекстЗапроса, "КонтролируемыйПоказатель", Ложь);
		ДополнитьТекстЗапроса(ТекстЗапроса, "РассчитываетсяПослеКонвертации", Ложь);
		
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса + "
		|;
		|ВЫБРАТЬ * ИЗ ВнутренняяТаблица";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	РезультатЗапроса		= Запрос.ВыполнитьПакет();
	ТекущаяТаблицаВыбора	= РезультатЗапроса[2].Выгрузить();
	
	Выборка = РезультатЗапроса[1].Выбрать();
	
	СтруктураНачальногоЗаполнения = Новый Структура;
	Пока Выборка.Следующий() Цикл
		СтруктураНачальногоЗаполнения.Вставить(Выборка.Ключ, Выборка.Значение);
	КонецЦикла;
	
	Возврат СтруктураНачальногоЗаполнения;
	
КонецФункции

Функция ЗаписатьИзмененныеДанные(ФормаЭлемента, ТаблицаДанных, ТипЭлемента) Экспорт
	
	СтруктураИзмененныхДанных = Новый Структура;
	РеквизитыФормы = ФормаЭлемента.ПолучитьРеквизиты();
	Для Каждого Элемент Из РеквизитыФормы Цикл
		Если СтрЧислоВхождений(Элемент.Имя, "Изменить") > 0 Тогда
			Если ФормаЭлемента[Элемент.Имя] Тогда
				ИмяРеквизита = СтрЗаменить(Элемент.Имя, "Изменить", "");
				СтруктураИзмененныхДанных.Вставить(ИмяРеквизита, ФормаЭлемента[ИмяРеквизита]);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	МассивНаследуемыхРеквизитовКолонка = Новый Массив;
	МассивНаследуемыхРеквизитовКолонка.Добавить("ВидИтогаПоСчету");
	
	МассивНаследуемыхРеквизитовСтрока = Новый Массив;
	МассивНаследуемыхРеквизитовСтрока.Добавить("ГруппаРаскрытия");
	МассивНаследуемыхРеквизитовСтрока.Добавить("СчетБД");
	
	НачатьТранзакцию();
		
	Для Каждого Элемент Из ТаблицаДанных Цикл
		
		ЭлементОбъект = Неопределено;
		
		Для Каждого КлючИЗначение Из СтруктураИзмененныхДанных Цикл
			
			Если Элемент[КлючИЗначение.Ключ] <> КлючИЗначение.Значение Тогда
				
				Если ТипЭлемента = "Показатель" Тогда
					
					Если МассивНаследуемыхРеквизитовСтрока.Найти(КлючИЗначение.Ключ) <> Неопределено Тогда
						
						ЗначениеРеквизитаСтроки = Элемент[КлючИЗначение.Ключ + "Строка"];
						
						Если ЗначениеРеквизитаСтроки <> КлючИЗначение.Значение
							И НЕ (КлючИЗначение.Ключ = "ГруппаРаскрытия" И Элемент.ГруппаРаскрытияСтрока.Пустая()) Тогда
							Продолжить;
						КонецЕсли;
						
					КонецЕсли;
					
					Если МассивНаследуемыхРеквизитовКолонка.Найти(КлючИЗначение.Ключ) <> Неопределено Тогда
						
						ЗначениеРеквизитаКолонки = Элемент[КлючИЗначение.Ключ + "Колонка"];
						
						Если ЗначениеРеквизитаКолонки <> КлючИЗначение.Значение Тогда
							Продолжить;
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
				
				Если ЭлементОбъект = Неопределено Тогда
					ЭлементОбъект = Элемент.Ссылка.ПолучитьОбъект();
				КонецЕсли;
				
				ЭлементОбъект[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЭлементОбъект <> Неопределено Тогда
			Попытка
				ЭлементОбъект.Записать();
			Исключение
				ИнформацияОбОшибке = ИнформацияОбОшибке();
				ТекстСообщения = НСтр("ru = 'Не удалось записать объект ""%1"", по причине: %2'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,
					ЭлементОбъект, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
				ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
				ОтменитьТранзакцию();
				Возврат Ложь;
			КонецПопытки;
		КонецЕсли;
			
	КонецЦикла;
	
	Если ТипЭлемента = "Строка" Тогда
		
		НаследуемыеРеквизиты = Новый Структура;
		Для Каждого СтрРеквизит Из МассивНаследуемыхРеквизитовСтрока Цикл
			Если СтруктураИзмененныхДанных.Свойство(СтрРеквизит) Тогда
				Если СтрРеквизит = "ГруппаРаскрытия" И СтруктураИзмененныхДанных[СтрРеквизит].Пустая() Тогда
					Продолжить;
				КонецЕсли;
				НаследуемыеРеквизиты.Вставить(СтрРеквизит, СтруктураИзмененныхДанных[СтрРеквизит]);
			КонецЕсли;
		КонецЦикла;
		
		Если СтруктураИзмененныхДанных.Количество() > 0 Тогда
			
			Для Каждого СтрокаПоказателя Из СтруктураИзмененныхДанных Цикл
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ПоказателиОтчетов.Ссылка
				|ИЗ
				|	Справочник.ПоказателиОтчетов КАК ПоказателиОтчетов
				|ГДЕ
				|	ПоказателиОтчетов.Строка = &Строка";
				
				Запрос.УстановитьПараметр("Строка", СтрокаПоказателя);
				
				Выборка = Запрос.Выполнить().Выбрать();
		
				Пока Выборка.Следующий() Цикл 
					
					ПоказательОбъект = Выборка.Ссылка.ПолучитьОбъект();
					Для Каждого Элемент Из НаследуемыеРеквизиты Цикл
						ПоказательОбъект[Элемент.Ключ] = Элемент.Значение;
					КонецЦикла;
					
					Попытка
						ПоказательОбъект.Записать();
					Исключение
						ИнформацияОбОшибке = ИнформацияОбОшибке();
						ТекстСообщения = НСтр("ru = 'Не удалось записать объект ""%1"", по причине: %2'");
						ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,
							ЭлементОбъект, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
						ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
						ОтменитьТранзакцию();
						Возврат Ложь;
					КонецПопытки;
					
				КонецЦикла;
				
			КонецЦикла;

		КонецЕсли;
			
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДополнитьТекстЗапроса(ТекстЗапроса, ИмяРеквизита, Первый)
	
	ТекстЗапроса = ТекстЗапроса + ?(Первый, ";", "
	|ОБЪЕДИНИТЬ") + "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	""" + ИмяРеквизита + """ КАК Ключ,
	|	ВТ_Вн." + ИмяРеквизита + " КАК Значение
	|ИЗ
	|	ВнутренняяТаблица КАК ВТ_Вн
	|ГДЕ
	|	1 В
	|		(ВЫБРАТЬ
	|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ." + ИмяРеквизита + ")
	|		ИЗ
	|			ВнутренняяТаблица КАК ВТ)";
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
